<?xml version="1.0" ?>
<net name="bert-small-uncased-whole-word-masking-squad-0001" version="10">
	<layers>
		<layer id="0" name="attention_mask" type="Parameter" version="opset1">
			<data element_type="i32" shape="1, 384"/>
			<output>
				<port id="0" names="attention_mask" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="token_type_ids" type="Parameter" version="opset1">
			<data element_type="i32" shape="1, 384"/>
			<output>
				<port id="0" names="token_type_ids" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_ids" type="Parameter" version="opset1">
			<data element_type="i32" shape="1, 384"/>
			<output>
				<port id="0" names="input_ids" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="bert.embeddings.word_embeddings.weight" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="30522, 1024" size="62509056"/>
			<output>
				<port id="0" names="bert.embeddings.word_embeddings.weight" precision="FP16">
					<dim>30522</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="302/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="5" name="3022880" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30522</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="302" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="bert.embeddings.position_embeddings.weight" type="Const" version="opset1">
			<data element_type="f16" offset="62509064" shape="512, 1024" size="1048576"/>
			<output>
				<port id="0" names="bert.embeddings.position_embeddings.weight" precision="FP16">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="292/Broadcast/FillValue" type="Const" version="opset1">
			<data element_type="i64" offset="63557640" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="289" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" names="289" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="288" type="Const" version="opset1">
			<data element_type="i32" offset="63557648" shape="" size="4"/>
			<output>
				<port id="0" names="288" precision="I32"/>
			</output>
		</layer>
		<layer id="10" name="290/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="11" name="2902992" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="290" precision="I64"/>
			</output>
		</layer>
		<layer id="12" name="291/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="291/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="291" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="292/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="292" precision="I64">
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="293" type="NonZero" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" names="293" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="2004" type="Const" version="opset1">
			<data element_type="i64" offset="63557652" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="294" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="294" precision="I64">
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="295/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="63557640" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="295" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>384</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="295,296" precision="I64">
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="297/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="297/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="297" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="286" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" names="286" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="285" type="Const" version="opset1">
			<data element_type="i32" offset="63557668" shape="" size="4"/>
			<output>
				<port id="0" names="285" precision="I32"/>
			</output>
		</layer>
		<layer id="24" name="287/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="25" name="2872916" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="287" precision="I64"/>
			</output>
		</layer>
		<layer id="26" name="298/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="298/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="298" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="299/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="299/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="299" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="300" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="300" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="301" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="3032886/Cast_1" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" names="301" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="303/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="34" name="3032886" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="303" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="305" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="305" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="bert.embeddings.token_type_embeddings.weight" type="Const" version="opset1">
			<data element_type="f16" offset="63557672" shape="2, 1024" size="4096"/>
			<output>
				<port id="0" names="bert.embeddings.token_type_embeddings.weight" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="304/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="38" name="3042968" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="304" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="306" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="306" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="2654_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="63561768" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="315" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" eps_mode="INSIDE_SQRT" normalize_variance="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="315" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="bert.embeddings.LayerNorm.weight" type="Const" version="opset1">
			<data element_type="f16" offset="63561776" shape="1, 1, 1024" size="2048"/>
			<output>
				<port id="0" names="bert.embeddings.LayerNorm.weight" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="316" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="316" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="bert.embeddings.LayerNorm.bias" type="Const" version="opset1">
			<data element_type="f16" offset="63563824" shape="1, 1, 1024" size="2048"/>
			<output>
				<port id="0" names="bert.embeddings.LayerNorm.bias" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="317" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="317" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="318" type="Const" version="opset1">
			<data element_type="f16" offset="63565872" shape="512, 1024" size="1048576"/>
			<output>
				<port id="0" names="318" precision="FP16">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="319" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="319" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="bert.encoder.input_transform.bias" type="Const" version="opset1">
			<data element_type="f16" offset="64614448" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" names="bert.encoder.input_transform.bias" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="320" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="320" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="321" type="Const" version="opset1">
			<data element_type="f16" offset="64615472" shape="512, 512" size="524288"/>
			<output>
				<port id="0" names="321" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="322" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="322" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="bert.encoder.layer.0.attention.self.query.bias" type="Const" version="opset1">
			<data element_type="f16" offset="65139760" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" names="bert.encoder.layer.0.attention.self.query.bias" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="323" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="323" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="331" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="331" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="330" type="Const" version="opset1">
			<data element_type="i32" offset="63557668" shape="" size="4"/>
			<output>
				<port id="0" names="330" precision="I32"/>
			</output>
		</layer>
		<layer id="56" name="332/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="57" name="3322946" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="332" precision="I64"/>
			</output>
		</layer>
		<layer id="58" name="338/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="338/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="338" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="334" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="334" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="333" type="Const" version="opset1">
			<data element_type="i32" offset="63557648" shape="" size="4"/>
			<output>
				<port id="0" names="333" precision="I32"/>
			</output>
		</layer>
		<layer id="62" name="335/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="63" name="3353028" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="335" precision="I64"/>
			</output>
		</layer>
		<layer id="64" name="339/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="339/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="339" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="340/Unsqueeze" type="Const" version="opset1">
			<data element_type="i64" offset="65140784" shape="1" size="8"/>
			<output>
				<port id="0" names="340" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="341/Unsqueeze" type="Const" version="opset1">
			<data element_type="i64" offset="65140792" shape="1" size="8"/>
			<output>
				<port id="0" names="341" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="342" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="342" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="343" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="343" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="2086" type="Const" version="opset1">
			<data element_type="i64" offset="65140800" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="344" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="344" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="324" type="Const" version="opset1">
			<data element_type="f16" offset="65140832" shape="512, 512" size="524288"/>
			<output>
				<port id="0" names="324" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="325" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="325" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="bert.encoder.layer.0.attention.self.key.bias" type="Const" version="opset1">
			<data element_type="f16" offset="65665120" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" names="bert.encoder.layer.0.attention.self.key.bias" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="326" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="326" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="346" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="346" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="345" type="Const" version="opset1">
			<data element_type="i32" offset="63557668" shape="" size="4"/>
			<output>
				<port id="0" names="345" precision="I32"/>
			</output>
		</layer>
		<layer id="78" name="347/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="79" name="3472864" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="347" precision="I64"/>
			</output>
		</layer>
		<layer id="80" name="353/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="353/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="353" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="349" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="349" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="348" type="Const" version="opset1">
			<data element_type="i32" offset="63557648" shape="" size="4"/>
			<output>
				<port id="0" names="348" precision="I32"/>
			</output>
		</layer>
		<layer id="84" name="350/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="85" name="3503024" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="350" precision="I64"/>
			</output>
		</layer>
		<layer id="86" name="354/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="354/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="354" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="355/Unsqueeze" type="Const" version="opset1">
			<data element_type="i64" offset="65140784" shape="1" size="8"/>
			<output>
				<port id="0" names="355" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="356/Unsqueeze" type="Const" version="opset1">
			<data element_type="i64" offset="65140792" shape="1" size="8"/>
			<output>
				<port id="0" names="356" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="357" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="357" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="358" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="358" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="2074" type="Const" version="opset1">
			<data element_type="i64" offset="65666144" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="374" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="377_copy/const26874" type="Const" version="opset1">
			<data element_type="f16" offset="65666176" shape="1, 8, 1, 1" size="16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="377_copy" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="374" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="375" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" names="377" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="278/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="63557640" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="278/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="278" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="279/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="65666192" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="279/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="279" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="280" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="data_mul_24660" type="Const" version="opset1">
			<data element_type="f16" offset="65666200" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="282/neg_/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="data_add_24662" type="Const" version="opset1">
			<data element_type="f16" offset="65666202" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="282/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="284" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="378" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" names="378" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="379/FlattenONNX_/input_shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="379/FlattenONNX_/input_shape/Indices" type="Const" version="opset1">
			<data element_type="i32" offset="65666204" shape="3" size="12"/>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="379/FlattenONNX_/input_shape/Axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="110" name="379/FlattenONNX_/input_shape/Gather" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="379/FlattenONNX_/first_dims/value" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="379/FlattenONNX_/first_dims" type="ReduceProd" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="379/FlattenONNX_/second_dims" type="Const" version="opset1">
			<data element_type="i64" offset="63561768" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="379/FlattenONNX_/first_dims/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="379/FlattenONNX_/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>3072</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="379/Softmax_" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>3072</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>3072</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="379/ShapeOf_" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="379" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>3072</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="379" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="327" type="Const" version="opset1">
			<data element_type="f16" offset="65666216" shape="512, 512" size="524288"/>
			<output>
				<port id="0" names="327" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="328" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="328" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="bert.encoder.layer.0.attention.self.value.bias" type="Const" version="opset1">
			<data element_type="f16" offset="66190504" shape="1, 1, 512" size="1024"/>
			<output>
				<port id="0" names="bert.encoder.layer.0.attention.self.value.bias" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="329" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="329" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="360" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="360" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="359" type="Const" version="opset1">
			<data element_type="i32" offset="63557668" shape="" size="4"/>
			<output>
				<port id="0" names="359" precision="I32"/>
			</output>
		</layer>
		<layer id="125" name="361/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="126" name="3612964" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="361" precision="I64"/>
			</output>
		</layer>
		<layer id="127" name="367/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="367/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="367" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="363" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="363" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="362" type="Const" version="opset1">
			<data element_type="i32" offset="63557648" shape="" size="4"/>
			<output>
				<port id="0" names="362" precision="I32"/>
			</output>
		</layer>
		<layer id="131" name="364/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="132" name="3643018" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="364" precision="I64"/>
			</output>
		</layer>
		<layer id="133" name="368/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="368/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="368" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="369/Unsqueeze" type="Const" version="opset1">
			<data element_type="i64" offset="65140784" shape="1" size="8"/>
			<output>
				<port id="0" names="369" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="370/Unsqueeze" type="Const" version="opset1">
			<data element_type="i64" offset="65140792" shape="1" size="8"/>
			<output>
				<port id="0" names="370" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="371" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="371" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="372" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="372" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="2113" type="Const" version="opset1">
			<data element_type="i64" offset="65140800" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="373" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="373" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="380" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="380" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="2011" type="Const" version="opset1">
			<data element_type="i64" offset="65140800" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="381" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="381" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="383" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="383" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="382" type="Const" version="opset1">
			<data element_type="i32" offset="63557668" shape="" size="4"/>
			<output>
				<port id="0" names="382" precision="I32"/>
			</output>
		</layer>
		<layer id="146" name="384/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="147" name="3843032" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="384" precision="I64"/>
			</output>
		</layer>
		<layer id="148" name="389/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="389/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="389" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="386" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="386" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="385" type="Const" version="opset1">
			<data element_type="i32" offset="63557648" shape="" size="4"/>
			<output>
				<port id="0" names="385" precision="I32"/>
			</output>
		</layer>
		<layer id="152" name="387/axis" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
